// Задача 19
// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да

string GetInfo(string message);
{
    Console.Write(message);
    return Console.ReadLine();
}

string user_num = ("Введите пятизначное число: ")ж
